Конфигурация/InformationRegisters/ПроверкаЗагруженныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ПроверкаЗагруженныхДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Проверен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПроверкаЗагруженныхДанных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет объект в список на проверку загруженных данных
//
// Параметры:
//   СсылкаИлиМассивСсылок - СправочникСсылка.Контрагенты, ВходящиеДокументы, ВнутренниеДокументы, ИсходящиеДокументы
//   Проверен - Булево - объект будет добавлен список на проверку загруженных данных с этим признаком
//
Процедура УстановитьПризнакПроверки(СсылкаИлиМассивСсылок, Проверен) Экспорт
	
	Если ТипЗнч(СсылкаИлиМассивСсылок) <> Тип("Массив")
		Или ТипЗнч(СсылкаИлиМассивСсылок) <> Тип("ФиксированныйМассив")
		Или ТипЗнч(СсылкаИлиМассивСсылок) <> Тип("СписокЗначений") Тогда
		
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(СсылкаИлиМассивСсылок);
	Иначе
		МассивСсылок = СсылкаИлиМассивСсылок;
	КонецЕсли; 
	
	МенеджерЗаписиРегистра = РегистрыСведений.ПроверкаЗагруженныхДанных.СоздатьМенеджерЗаписи();
	Для Каждого Ссылока Из МассивСсылок Цикл
		МенеджерЗаписиРегистра.Объект = Ссылока;
		МенеджерЗаписиРегистра.Прочитать();
		МенеджерЗаписиРегистра.Проверен = Проверен;
		Если Проверен Тогда
			МенеджерЗаписиРегистра.Проверил = ПользователиКлиентСервер.ТекущийПользователь();
			МенеджерЗаписиРегистра.ДатаПроверки = ТекущаяДатаСеанса();
		Иначе
			МенеджерЗаписиРегистра.Проверил = Справочники.Пользователи.ПустаяСсылка();
			МенеджерЗаписиРегистра.ДатаЗагрузки = ТекущаяДатаСеанса();
			МенеджерЗаписиРегистра.ДатаПроверки = Дата(1,1,1);
		КонецЕсли; 
		МенеджерЗаписиРегистра.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
